FROM node   
# คำสั่งเพื่อเรียกใช้ base image ที่จะมาเป็นสภาพแวดล้อมหลักในการทำงานสำหรับโปรเจคเรา

RUN mkdir -p /user/src/app
#คำสั่งเพื่อการดำเนินการคำสั่งที่ต้องการ
WORKDIR /user/src/app
# คำสั่งเพื่อกำหนด Directory สำหรับการทำงานเพื่อให้คำสั่งอื่นๆที่เราจะใช้อย่างเช่น RUN, COPY และ อื่นๆ ให้ไปเริ่มต้นทำงานที่ Directory นั้น

COPY package.json /user/src/app
# คำสั่งเพื่อการคัดลอกไฟล์ต่างๆจากที่หนึ่ง ไปไว้ยังที่ ที่เราต้องการ
RUN npm install 
# คำสั่งเพื่อการดำเนินการคำสั่งที่ต้องการ

COPY . /user/src/app
# คำสั่งเพื่อการคัดลอกไฟล์ต่างๆจากที่หนึ่ง ไปไว้ยังที่ ที่เราต้องการ

EXPOSE 3000
# คำสั่งเพื่อกำหนด port ให้ Docker ที่จะให้เห็นระหว่างผู้สร้างกับผู้ใช้งาน

CMD ["npm", "start"]
# คำสั่งเพื่อการสั่งให้ทำงานบางสิ่งที่เราต้องการ